IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/am243x/DMASS0_RINGACC_0_RINGACC_RT.xml
<module name="DMASS0_RINGACC_0_RINGACC_RT" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="RINGACC_RT_RT_DB" acronym="RINGACC_RT_RT_DB" offset="0x10" width="32" description="The Ring N Doorbell Register is written by software to increment or decrement the number of entries on a Ring.  One or more entries as specified by the entry_cnt field can be added to a ring with a single write operation.">
		<bitfield id="ENTRY_CNT" width="8" begin="7" end="0" resetval="0x0" description="Signed number of entries by which to increment the ring occupancy. For normal Tx Ring operation, this value should be a positive number.  This occ value for the ring is increased by this value each time the doorbell register is written (occ absolute value will increase or decrease based on the sign of the tentry_cnt)." range="7 - 0" rwaccess="NA/W"/>
	</register>
	<register id="RINGACC_RT_RT_OCC" acronym="RINGACC_RT_RT_OCC" offset="0x18" width="32" description="The Ring N Occupancy Register can be read by software to determine the total number of valid entries on a ring.  The contents of each of these registers are unary ORed in order to create a pending signal for the ring which can be used for triggering hardware operations and/or for generating interrupts to the host.">
		<bitfield id="OCC" width="21" begin="20" end="0" resetval="0x0" description="Total number of valid entries on the ring.  This value is generally intended to be incremented by doorbell pokes from software and is decremented by the DMA engine as entries are completed." range="20 - 0" rwaccess="R/NA"/>
	</register>
	<register id="RINGACC_RT_RT_INDX" acronym="RINGACC_RT_RT_INDX" offset="0x1C" width="32" description="The Ring N Current Index Register can be read by software for debug purposes to determine the current SW read index for the Ring for the channel.">
		<bitfield id="INDX" width="20" begin="19" end="0" resetval="0x0" description="Current SW owned read index for the ring.  This value is initialized to 0 when the ring is set up and will be incremented by SW each time SW processes a ring entry.  When the index is incremented to a value equal to the size field in the Ring Size Register for the ring the index will be reset back to 0." range="19 - 0" rwaccess="R/NA"/>
	</register>
	<register id="RINGACC_RT_RT_HWOCC" acronym="RINGACC_RT_RT_HWOCC" offset="0x20" width="32" description="The Ring N Hardware Occupancy Register contains the early increment/decrement version of the the total number of valid entries on a ring.  The contents of each of these registers are unary ORed in order to create a pending signal for the ring which can be used for triggering hardware operations and/or for generating interrupts to the host.">
		<bitfield id="OCC" width="21" begin="20" end="0" resetval="0x0" description="Total number of valid entries on the ring.  This value is generally intended to be incremented by doorbell pokes from software and is decremented by the DMA engine as entries are completed." range="20 - 0" rwaccess="R/NA"/>
	</register>
	<register id="RINGACC_RT_RT_HWINDX" acronym="RINGACC_RT_RT_HWINDX" offset="0x24" width="32" description="The Ring N Current Index Register can be read by software for debug purposes to determine the current HW read index for the Ring for the channel.">
		<bitfield id="INDX" width="20" begin="19" end="0" resetval="0x0" description="Current HW owned read index for the ring.  This value is initialized to 0 when the ring is set up and will be incremented by HW each time HW processes a ring entry.  When the index is incremented to a value equal to the size field in the Ring Size Register for the ring the index will be reset back to 0." range="19 - 0" rwaccess="R/NA"/>
	</register>
</module>